In [31]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

In [32]:
password = getpass.getpass()

········

In [33]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM rental', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [34]:
#Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

#engine: an object representing the database connection engine to be used to establish a connection to the Sakila database.
#month: an integer representing the month for which rental data is to be retrieved.
#year: an integer representing the year for which rental data is to be retrieved.
#The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [35]:
def rentals_month(engine, month, year):
    query = f"""
    SELECT *
    FROM rental
    WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}
    """
    
    df = pd.read_sql_query(query, engine)
    
    return df

In [36]:
rentals_month_df_secondmonthsample = rentals_month(engine,"06","2005")
print(rentals_month_df_secondmonthsample.head(3))
rentals_month_df_3 = rentals_month_df_secondmonthsample.copy()

   rental_id         rental_date  inventory_id  customer_id  \
0       1158 2005-06-14 22:53:33          1632          416
1       1159 2005-06-14 22:55:13          4395          516
2       1160 2005-06-14 23:00:34          2795          239

          return_date  staff_id         last_update
0 2005-06-18 21:37:33         2 2006-02-15 21:30:53
1 2005-06-17 02:11:13         1 2006-02-15 21:30:53
2 2005-06-18 01:58:34         2 2006-02-15 21:30:53

In [37]:
rentals_month_df = rentals_month(engine,"05","2005")
print(rentals_month_df.head(3))
rentals_month_df_2 = rentals_month_df.copy()

   rental_id         rental_date  inventory_id  customer_id  \
0          1 2005-05-24 22:53:30           367          130
1          2 2005-05-24 22:54:33          1525          459
2          3 2005-05-24 23:03:39          1711          408

          return_date  staff_id         last_update
0 2005-05-26 22:04:30         1 2006-02-15 21:30:53
1 2005-05-28 19:40:33         1 2006-02-15 21:30:53
2 2005-06-01 22:12:39         1 2006-02-15 21:30:53

In [38]:
def rental_count_month(df, month, year):
    # Group by customer_id and count the rentals
    df_count = df.groupby('customer_id').size().reset_index(name=f'rentals_{month}_{year}')
    
    return df_count

In [39]:
rental_count_month_df_secondmonthsample = rental_count_month(rentals_month_df_3,"06","2005")

In [40]:
rental_count_month_df_secondmonthsample = rental_count_month_df_secondmonthsample.copy()

In [41]:
rental_count_month_df = rental_count_month(rentals_month_df_2,"05","2005")

In [42]:
rental_count_month_df_firstmonthsample = rental_count_month_df.copy()

In [43]:
def compare_rentals(df1, df2):
    # Merge the two dataframes on customer_id
    df = pd.merge(df1, df2, on='customer_id')

    # Assume that the second column in each dataframe is the number of rentals
    rental_col1, rental_col2 = df.columns[1], df.columns[2]

    # Calculate the difference in rentals
    df['difference'] = df[rental_col1] - df[rental_col2]

    return df

In [44]:
compare_rentals(rental_count_month_df_secondmonthsample, rental_count_month_df_firstmonthsample)

     customer_id  rentals_06_2005  rentals_05_2005  difference
0              1                7                2           5
1              2                1                1           0
2              3                4                2           2
3              5                5                3           2
4              6                4                3           1
..           ...              ...              ...         ...
507          594                6                4           2
508          595                2                1           1
509          596                2                6          -4
510          597                3                2           1
511          599                4                1           3

[512 rows x 4 columns]